#### ReferencePointArray Members

---

|  |
| --- |
| ReferencePointArray Class   Constructors   Methods   Properties   See Also |

The  ReferencePointArray  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ReferencePointArray | Initializes a new instance of the  ReferencePointArray  class |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Append |  |
| Public method | Clear | Removes every reference from the array, rendering it empty. |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | ForwardIterator | Retrieve a forward moving iterator to the array. |
| Public method | GetEnumerator | Retrieve a forward moving iterator to the array. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | Insert |  |
| Public method | ReverseIterator | Retrieve a backward moving iterator to the array. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsEmpty | Test to see if the array is empty. |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from  APIObject  .) |
| Public property | Item | Gets or sets a reference at a specified index within the array. |
| Public property | Size | Returns the number of references that are in the array. |

# See Also

ReferencePointArray Class

Autodesk.Revit.DB Namespace